{"file_name": "eng_1.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram appears to represent a control and data flow system for an astronomical observation setup, possibly for a telescope with adaptive optics and laser systems. The diagram is color-coded to indicate different types of data and command flows, such as non-real-time commands & data (blue lines), real-time commands & data (green lines), and real-time diagnostic data (high-speed) (red lines).Starting from the top left, we have Atmospheric Tools which are connected to the Instrument Sequencer. The Instrument Sequencer is connected to the Telescope Interface, which in turn is connected to the Acquisition, Guiding & Pointing Cntrl (Control) block.Moving to the top center, there is a Multi-system Command Sequencer which is connected to the User Interfaces & Tools block on its right and the AO Sequencer (Adaptive Optics Sequencer) on its left. The AO Sequencer is also connected to the Acquisition, Guiding & Pointing Cntrl.On the top right, there are Pre- & Post-Observing Tools connected to the Laser Traffic Cntrl System (Control System), which is connected to the Laser Sequencer. The Laser Sequencer is connected to the Laser Control block, which is also connected to the Data Server.The Acquisition, Guiding & Pointing Cntrl is centrally located and has connections to the AO Control and Laser Control blocks. The AO Control block is connected to AO Devices and a Real-Time Controller. The Real-Time Controller is connected to Laser Devices and also to the UTT (which is not defined in the diagram but could stand for a specific technical term relevant to the system).The Laser Control block is connected to the Data Server and receives telemetry data from the Laser Devices. Both the AO Control and Laser Control blocks send status information to each other.The Data Server is connected to the Data Server Interface and receives real-time diagnostics (RT Diags) data from both the Laser Devices and the AO Devices.In summary, the diagram shows a complex system where various sequencers and control units interact with each other and with devices such as adaptive optics and lasers to control a telescope's acquisition, guiding, and pointing capabilities. The system also includes interfaces for user interaction and data handling, with a data server collecting and managing telemetry and diagnostic information.\"}}"}
{"file_name": "eng_10.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents a process flow in a chemical or petrochemical production system. Here is a detailed description of the connections and relations depicted in the diagram:1. **Feed Purification (1)**: The process starts with a feedstock that undergoes purification in the first feed purification block. The feedstock input is quantified as 60 tons per day (t/d).2. **Feed Purification (2)**: There is a second feed purification block that also receives feedstock, this time with an input of 50 t/d. It's not clear from the diagram whether these two feed purification blocks operate in parallel, in series, or if they handle different components of the feedstock.3. **Reaction**: The outputs from both feed purification blocks (1) and (2) are directed into a reaction block. This is where the chemical reaction takes place, transforming the purified feedstock into a crude product.4. **Primary Separation**: The crude product from the reaction block is then sent to a primary separation block. Here, the mixture is likely separated into the desired product, by-products, and unreacted feedstock.5. **Recycle Stream**: A portion of the output from the primary separation is recycled back into the reaction block. This is typically done to improve the efficiency of the reaction by reusing unreacted materials.6. **By-products**: The primary separation process also yields by-products, which are quantified as 19 t/d. These are likely substances that are not the main product of the reaction and may require further processing or disposal.7. **Heavy Ends Removal**: Another output from the primary separation is directed to a heavy ends removal block. This step is designed to remove heavier fractions from the product stream, which are often undesirable.8. **Heavy Ends Purge**: After the heavy ends are removed, there is a purge stream of 1 t/d. This stream is likely waste material that needs to be discarded or treated.9. **Final Product Purification**: The main product stream from the primary separation undergoes a final purification step. This is to ensure that the final product meets the required specifications for purity.10. **Final Product**: The output from the final product purification block is the final product of the process, with a quantity of 90 t/d. This is the desired product that the entire process aims to produce.The diagram provides a simplified overview of a chemical production process, focusing on the flow of materials through various stages of purification, reaction, separation, and removal of by-products and heavy ends, culminating in the production of a purified final product.\"}}"}
{"file_name": "eng_11.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents a system with various components organized into three main sections: Signal Conditioning, Supply Control, and Wireless Interface. Here's a detailed description of the connections and relations between the components:1. Signal Conditioning: - Inputs E1, E2, and REF are connected to an Input Amplifier, which likely amplifies the signals received. - The output of the Input Amplifier is then fed into a Highpass Filter, which removes the low-frequency components from the signal. - The output of the Highpass Filter goes into a Lowpass Filter, which removes the high-frequency components, thus allowing only a certain band of frequencies to pass through. - The output from the Lowpass Filter is then sent to a Level Shifter, which adjusts the signal levels to be suitable for the next stage in the process.2. Supply Control: - The Supply Control section includes a Voltage Inverter and a Voltage Regulator. The Voltage Inverter likely changes the polarity of the voltage, and the Voltage Regulator stabilizes the voltage to a specific level required by the system. - There is also an Energy Harvesting block, which suggests that the system is capable of extracting energy from external sources to power itself. - The Antenna Circuit is connected to an antenna (ANT), which is used for wireless communication. The Antenna Circuit is likely responsible for matching the impedance and possibly for tuning the frequency of the signals transmitted and received by the antenna.3. Wireless Interface: - The Level Shifter from the Signal Conditioning section is connected to an A/D Converter in the Wireless Interface section. The A/D Converter converts the analog signals into digital signals for processing by the Processor. - The Processor is the central unit that manages the operations of the system. It is connected to the Oscillator, which provides the clock signals necessary for the operation of the Processor. - The Processor is also connected back to the Energy Harvesting block and the Antenna Circuit, indicating that it controls or processes the energy harvesting functions and the wireless communication.Overall, the diagram suggests a system that processes input signals, conditions them, manages power supply, and communicates wirelessly, possibly for applications such as remote sensing, telemetry, or other wireless-enabled devices. The exact nature of the E1, E2, and REF inputs, as well as the specific functions of the Processor, would depend on the context in which this system is used.\"}}"}
{"file_name": "eng_12.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents the internal workings of a color television system. Here's a detailed description of the connections and relations depicted:1. **RF Tuner**: This is the starting point of the signal processing chain. The RF (Radio Frequency) tuner receives the broadcast signal and selects the desired channel frequency.2. **IF Section**: The signal from the RF tuner is passed to the IF (Intermediate Frequency) section. This stage amplifies and converts the frequency of the signal to a standard intermediate frequency for further processing.3. **SYNC**: A portion of the signal from the IF section is sent to the SYNC (synchronization) block. This block extracts synchronization information necessary for the proper timing of the picture and sound.4. **Deflection**: The SYNC block sends signals to the Deflection block, which controls the scanning of the electron beams across the picture tube to create the image.5. **Convergence**: The Deflection block also connects to the Convergence block. Convergence aligns the red, green, and blue components of the image so that they overlap correctly on the screen, which is crucial for a clear and sharp color image.6. **Video Detector and Amplifier**: Another output from the IF section goes to the Video Detector and Amplifier. This block demodulates the video signal and amplifies it before sending it to the picture tube.7. **Chrominance**: The Video Detector and Amplifier also sends a signal to the Chrominance block. Chrominance processes the color information (hue and saturation) within the video signal.8. **Color Sync**: The Chrominance block sends a signal to the Color Sync block, which ensures that the color information is properly synchronized with the image being displayed.9. **Sound Section**: The IF section also sends a signal to the Sound Section, which processes the audio part of the broadcast signal.10. **Speaker**: The processed audio signal from the Sound Section is then sent to the Speaker, which outputs the sound.11. **Picture Tube**: The video signal from the Video Detector and Amplifier, along with the synchronization signals from the SYNC and Color Sync blocks, are sent to the Picture Tube. The Picture Tube, also known as the Color Kinescope, is where the visual part of the television signal is displayed.12. **High Voltage Section**: The High Voltage Section is connected to the Picture Tube. It generates the high voltage required for the electron beams in the Picture Tube to function and create the image on the screen.The diagram shows a flow of signals from the initial reception of the broadcast through various processing stages, resulting in audio output through the speaker and a visual display on the picture tube. Each block represents a specific function necessary for the television to work correctly, and the lines between them indicate the flow of signals through the system.\"}}"}
{"file_name": "eng_13.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents a control system with various inputs and outputs managed by a central processing unit (CPU). Here's a detailed description of the connections and relations depicted in the diagram:1. Input Circuit: The input circuit is connected to a series of sensors that provide data to the CPU. These sensors include: - Angle Sensor - Trolley Horizontal Displacement Sensor - Trolley Vertical Displacement Sensor - Tilt Sensor - Wind Speed Sensor - Load SensorEach of these sensors is designed to measure specific parameters, such as the angle of a device, the horizontal and vertical displacement of a trolley, the tilt angle, the speed of the wind, and the load or weight being measured.2. CPU: The central processing unit is the core of the system, responsible for processing the data received from the input circuit. It is also powered by an AC 220V/380V power source, as indicated by the arrow pointing upwards towards the CPU.3. Output Circuit: The CPU sends processed information and commands to the output circuit, which then interfaces with various components: - Flash Memory: Stores data for later retrieval or analysis. - GPS: Utilizes Global Positioning System technology for location tracking. - GPRS: General Packet Radio Service is used for wireless data communication. - LCD: A Liquid Crystal Display that shows information or data processed by the CPU.4. Voice Alarm: The output circuit is connected to a voice alarm, which likely serves as an audible alert system to notify operators or bystanders of certain conditions or warnings.5. Braking Controller: The output circuit also connects to a braking controller, which is responsible for managing the braking mechanism of the system. This could be related to the trolley system or any other machinery that requires controlled stopping.6. Directional Control: The braking controller has further connections to directional controls, which include: - Backward/Forward - Left/Right - Up/DownThese controls suggest that the system has the capability to manage movement in three-dimensional space, allowing for adjustments in horizontal, vertical, and lateral directions.Overall, the block diagram outlines a sophisticated control system with sensory inputs, data processing, and multiple outputs for data storage, communication, display, audible alerts, braking, and directional movement. This type of system could be used in various applications, such as industrial automation, vehicle control systems, or any context where precise monitoring and control of movement and environmental conditions are required.\"}}"}
{"file_name": "eng_14.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram describes a chemical process involving multiple steps, starting with reactants and ending with a final product ready for packaging. Here's a detailed description of the process as depicted in the diagram:1. The process begins with two reactants: Acetonitrile (labeled as 1) and Reactant A (labeled as 2). These two are introduced into a reaction vessel.2. In the reaction vessel, the mixture of Acetonitrile and Reactant A is subjected to agitation and heating to 85°C under reflux conditions, with approximately 20 wt% total of the mixture (as indicated in the block labeled 4).3. Once the reaction is complete, the product slurry is allowed to cool down to 25°C.4. The cooled product slurry then undergoes a filtration process (block labeled 6). During this step, the slurry is separated into a solid and a liquid phase. The solid phase is referred to as the wetcake, and the liquid phase is the filtrate.5. The wetcake is further processed with an Acetonitrile wash (labeled as 5) to purify the product.6. After the wash, the wetcake is dried using dry nitrogen gas (as indicated by dry N2 in the block labeled 8).7. Meanwhile, the filtrate from the filtration step is sent to a distillation process (block labeled Distill). The purpose of this step is to separate and recycle any unused reactants or solvents. The distillate, which contains Reactant B, is recycled back into the process (as shown by the arrow leading to Reactant B labeled 3).8. The non-recyclable residue from the distillation, referred to as Bottoms to Waste (block labeled 7), is disposed of as waste.9. The dried product, now ready for use, is sent to the final product packaging stage (block labeled 3).The diagram illustrates a closed-loop process where one of the reactants (Reactant B) is recycled back into the system, potentially reducing waste and improving the efficiency of the process. The process flow is designed to transform the initial reactants into a final product through a series of chemical reactions, separation, purification, and drying steps.\"}}"}
{"file_name": "eng_15.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram you've provided represents the structure of a vehicle, breaking down its main components and their sub-components. This type of diagram is often used in systems engineering to depict the organization of a system. Here's a detailed description of the diagram:At the top level, there is a single block labeled Vehicle, which represents the entire system. From this central block, there are three main components branching out:1. Wheel: The Vehicle block is connected to a block labeled Wheel, indicating that the wheel is a primary component of the vehicle. The Wheel block is further broken down into two sub-components: - Brake: This block represents the braking system associated with the wheel. The Brake block is further decomposed into three parts: - Rotor: A component of the brake system that the brake pads press against to slow down the wheel. - Caliper: The part of the brake system that houses the brake pads and pistons; it fits over the rotor. - Pad: The brake pad itself, which is the friction material that presses against the rotor to slow or stop the wheel. - Tire: This block represents the tire that is mounted on the wheel, which is in contact with the road surface.2. Engine: The second main component branching from the Vehicle block is the Engine. This block represents the engine of the vehicle, which is responsible for generating the power needed to propel the vehicle.3. Transmission: The third main component is the Transmission, which is connected to the Vehicle block. The transmission is the system that transmits the power generated by the engine to the wheels, allowing the vehicle to move and change speeds.Each block is denoted with the stereotype block, indicating that they are all considered as individual building blocks in the structure of the vehicle. The lines connecting the blocks represent relationships or associations, showing how each component is related to or interacts with the others within the vehicle's structure.The diagram is encapsulated within a package named bdd [Package] Structure [Vehicle Structure], suggesting that this block diagram is part of a larger system model, possibly within a software tool used for modeling the structure of vehicles.\"}}"}
{"file_name": "eng_16.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram provided represents the basic architecture of a computer system, illustrating the flow of data and control signals between the main components. Here's a detailed description of the diagram:1. Central Processing Unit (CPU): The CPU is the core of the computer system, responsible for processing instructions and managing the flow of data within the system. It is divided into two main parts: - Control Unit: This unit manages the execution of instructions by directing the operation of the other components of the CPU and the computer system. It decodes the instructions and generates the necessary signals to execute them. - Arithmetic Logic Unit (ALU): The ALU performs arithmetic and logical operations on the data provided to it. This includes operations like addition, subtraction, and logical comparisons.2. Storage Unit: The storage unit is where data is stored within the computer system. It is divided into two types: - Primary Storage: Also known as main memory or RAM (Random Access Memory), this is the storage area that the CPU can access directly and quickly. It is used to store data that is actively being used or processed by the CPU. - Secondary Storage: This refers to storage devices like hard drives, solid-state drives, and optical drives that provide long-term data storage. Data from secondary storage needs to be loaded into primary storage before the CPU can process it.3. Input Unit: The input unit is responsible for taking input from the user or from other systems. This includes devices like keyboards, mice, and scanners. The data from the input unit is sent to the primary storage and then processed by the CPU.4. Output Unit: The output unit is responsible for presenting the results of the computer's processing to the user or to other systems. This includes devices like monitors, printers, and speakers. The information (results) is generated after the CPU processes the data.The arrows in the diagram indicate the flow of instructions and data: - Solid arrows represent the flow of instructions and data between the components. - Dotted arrows represent the control exercised by the control unit over the other components, directing their operation.In summary, the diagram shows how a computer system processes data, starting with input from the user, which is then stored in memory, processed by the CPU, and finally output as results. The control unit oversees the entire process, ensuring that each component operates in coordination with the others.\"}}"}
{"file_name": "eng_17.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents a process flow for handling and processing a gas/solid feed, which eventually leads to the production of a final product and the management of waste. Here is a detailed description of the connections and relations depicted in the diagram:1. Inlets: The process begins with an inlet that introduces a gas/solid feed into the system.2. Filter: The gas/solid feed first passes through a filter, which likely removes particulate matter or impurities from the feed.3. Distillation: The filtered feed then enters a distillation unit, where it is separated into different components based on their boiling points. Steam is introduced into the distillation process, as indicated by the line labeled STEAM connecting to the distillation block.4. Cooling: The distilled components are then cooled down in a cooling unit.5. Wash: Following cooling, the components are washed, which could involve removing soluble impurities or further purifying the product.6. Compressor: The washed gas is then compressed, which could be for the purposes of increasing pressure for subsequent processing or storage.7. Heat Exchanger: The compressed gas passes through a heat exchanger, where its temperature is adjusted (either heated or cooled) through heat exchange with another medium.8. Liquefier: The temperature-adjusted gas is then sent to a liquefier, where it is converted into a liquid form.9. Storage: The liquefied product is stored, awaiting further processing or shipment.10. Evaporator: A portion of the stored liquid is sent to an evaporator, where it is turned back into a gas by the introduction of steam, as indicated by the second STEAM label.11. Pump/Tank: Concurrently, there is a branch in the process where gas is directed to a pump or tank. This could be for temporary holding or for recirculation within the process.12. Waste: The process generates waste, which is directed towards a waste management system.13. Second-Cycle Waste: Some of the waste is labeled as SECOND-CYCLE WASTE, suggesting that it may undergo a secondary process or is a byproduct of a secondary cycle within the overall process.14. Neutralization: The second-cycle waste is sent to a neutralization unit within a toxic-rated facility, indicating that the waste is hazardous and requires treatment to neutralize its toxicity.15. Shipping Process: The final product, after storage and possible evaporation, is prepared for distribution through a shipping process, which is represented by a truck icon.16. Product: The end result of the process is a product that is ready for the market or further use.The diagram outlines a comprehensive process involving various stages of purification, separation, conversion, and waste management, culminating in the production of a final product that is shipped out of the facility.\"}}"}
{"file_name": "eng_18.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The block diagram represents the architecture of a computer motherboard with various components and their interconnections. Here's a detailed description of the diagram:1. At the top, we have a Socket 479 CPU, which is the central processing unit of the computer. It is the main chip that performs computations and runs the operating system and applications.2. Connected to the CPU is the Chipset Graphics Memory Controller Hub. This component is responsible for handling the memory operations and the graphics output. It interfaces with the CPU and other parts of the system to manage data flow.3. The Single CH (Single Channel) connects the CPU to the SO-DIMM DDR2 SDRAM PC2-6400, which is the type of memory used by the system. SO-DIMM stands for Small Outline Dual In-line Memory Module, DDR2 SDRAM stands for Double Data Rate 2 Synchronous Dynamic Random-Access Memory, and PC2-6400 refers to the memory's speed.4. The Flash ROM is connected to the Chipset I/O Controller Hub via a bus. Flash ROM is a type of non-volatile memory that can be electrically erased and reprogrammed. It typically contains the system's firmware or BIOS.5. The Chipset I/O Controller Hub is connected to several components: - 2 Hi-Speed USB Connectors for connecting USB devices. - SATA (Serial Advanced Technology Attachment) for connecting storage devices like hard drives and SSDs. - Gigabit Ethernet for network connectivity.6. The Chipset I/O Controller Hub is also connected to a PCIe Connector through multiple PCI Express lanes (x1 PCIe). PCI Express (Peripheral Component Interconnect Express) is a high-speed interface standard for connecting peripherals to the motherboard.7. The PXI Trigger is a specialized connector used for triggering events in a PXI system, which is often used in test, measurement, and control systems.8. The Chipset Graphics Memory Controller Hub is connected to a DVI-I Connector, which is an interface for digital and analog video output.9. The Chipset I/O Controller Hub is connected to the Super I/O via the LPC Bus (Low Pin Count Bus). The Super I/O is a chip that interfaces with a variety of input/output devices.10. The Super I/O is connected to LPT 1 and COM 1, which are ports for parallel and serial communication, respectively. LPT 1 is typically used for connecting printers, while COM 1 is used for serial devices.11. The SMB to PXI Trigger and Watchdog Timer are connected to the Super I/O as well. SMB stands for System Management Bus, which is used for communication with low-speed system management devices. The Watchdog Timer is a hardware timer that can reset the system in case of a software fault.12. Finally, the SMB (System Management Bus) is shown at the bottom, which is likely connected to the Super I/O for system management communications and monitoring.This block diagram provides a high-level overview of the motherboard's layout and the connections between the various components that make up a computer system.\"}}"}
{"file_name": "kor_real_world_1.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"이 블록 다이어그램은 프로세스 개선 및 관리를 위한 시스템을 나타내며, '프로젝트 방향 설정', '현상의 문제점 분석', 그리고 '재설계 및 사후관리'의 세 가지 주요 구성 요소로 나뉩니다. '프로젝트 방향 설정'에서는 '방향 설정'이 'Master Plan 수립'으로 이어지고, 이는 다시 '프로세스 분류'로 연결됩니다. '현상의 문제점 분석'에서는 '프로세스 MAP분석', 'I/O 분석', '인사결정 분석', '서식 분석', 그리고 'System 분석'으로 세분화되어 각각의 분석이 '문제점 정의'로 통합됩니다. 마지막으로 '재설계 및 사후관리'에서는 '프로세스 및 워크플로우'가 'Input/Output 재설계' 또는 '서식의 재설계'로 이어지며, 이는 '인프라 재설계'를 거쳐 '실행계획 수립'으로 이어지거나, '프로세스 변화관리 요소도출'로 구체화됩니다. 이 다이어그램은 iGrafx Process Tool이 적용되었습니다.\"}}"}
{"file_name": "kor_real_world_10.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"이 블록 다이어그램은 특정 프로세스 또는 알고리즘의 흐름을 나타냅니다. 시작할 때 변수 'a'는 23으로 초기화되고, 변수 'n'은 0으로 초기화됩니다. 첫 번째 조건은 'a가 짝수인가?'를 묻습니다. 만약 '예'라면, 'a'는 'a' 나누기 2의 연산을 수행하고, '아니오'라면 'a'는 'a'에서 1을 뺀 값으로 업데이트됩니다. 그 다음 조건은 'a가 1인가?'를 묻습니다. 이 조건이 '예'라면, 'n'을 출력하고 프로세스가 종료됩니다. '아니오'라면, 'n'은 'n+1'로 업데이트되고, 다시 첫 번째 조건으로 돌아가 'a가 짝수인가?'를 다시 평가합니다. 이 과정은 'a'가 1이 될 때까지 반복됩니다.\"}}"}
{"file_name": "kor_real_world_100.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"전화번호 입력 후 '인증문자 발송' 버튼 클릭으로 이어집니다.'인증문자 발송' 버튼 클릭을 하면 전화번호 입력값 검증을 판별하며, 에러 메세지 경고와 인증번호 발송으로 분기 합니다.인증번호 발송이 되면 인증번호 입력필드+버튼 show를 실행하고, 입증번호 입력, '인증하기' 버튼 클릭을 순차적으로 진행합니다.\"}}"}
{"file_name": "kor_real_world_101.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"준비상태는 디스패치로 실행상태로 이동합니다.실행상태는 시간종료로 준비상태로 이동합니다. 실행상태는 입출력발생으로 대기(보류)상태로 이동합니다. 대기(보류)상태는 조건만족으로 준비상태로 이동합니다. 실행상태는 종료로 이동할 수 있습니다.\"}}"}
{"file_name": "kor_real_world_102.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"그림2. 그룹사 관계도 입니다.폴라리스오피스는 폴라리스웍스로 11.04% 수치로 화살표가 연결되어 있습니다.폴라리스오피스는 아이앤브이게임즈로 70% 수치로 화살표가 연결되어 있습니다.폴라리스웍스는 세원으로 8.11% 수치로 화살표가 연결되어 있습니다.세원는 폴라리스우노로 28.36% 수치로 화살표가 연결되어 있습니다.\"}}"}
{"file_name": "kor_real_world_103.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"첫번째 상태는 비어있으며, 시작점을 나타냅니다. 시작점에서 비행한다로 화살표가 이어집니다.비행한다는 원하는 경로인가의 결과로 분기합니다: 결과가 YES이면 데이터를 얻는다로 이동하고 결과가 NO이면 PID 게인 수정으로 이동합니다.데이터를 얻는다는 Regression으로 수식(경로)를 얻는다.로 이동하며 끝으로 이어집니다.PID 게인 수정은 비행한다로 다시 화살표가 이어집니다.\"}}"}
{"file_name": "kor_real_world_104.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"제출(Submit)은 접수(HOLD)와 화살표로 연결되어 있습니다.접수(HOLD)는 디스크와 Spooling관계이며 양방향으로 연결되어 있습니다.접수(HOLD)는 준비(Ready)와 화살표로 연결되어 있습니다. 준비(Ready)는 Dispatch로 실행(Run)과 화살표로 이어져 있습니다.실행(Run)은 선접, 시간초과로 준비(Ready)와 화살표로 이어져 있습니다. 실행(Run)은 입출력 발생으로 대기(Wait, Block)과 화살표로 이어져 있습니다. 대기(Wait, Block)는 입출력 종료 Wake Up으로 준비(Ready)로 화살표로 이어져 있습니다. 실행(Run)은 종료(Terminated, Exit)로 화살표로 이어져 있습니다. Job 스케쥴러는 다음 상태를 포함하고 있습니다: 준비(Ready), 실행(Run), 대기(Wait, Block)\"}}"}
{"file_name": "kor_real_world_105.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"START에서 집에서 걸어갈 수 있는 거리인가?로 결과에 따라 분기합니다: 결과가 yes이며 직장까지 걸어간다.로 이동하고, 결과가 No이면 차가 있는가?로 이동합니다.직장까지 걸어간다.는 END로 연결되어 종료됩니다.차가 있는가?는 결과에 따라 분기합니다: 결과가 yes이면 직장까지 운전한다.로 이동하고, No이면 대중교통을 이용한다.로 이동합니다.직장까지 운전한다.는 END로 연결되어 종료됩니다.대중교통을 이용한다.는 END로 연결되어 종료됩니다.\"}}"}
{"file_name": "kor_real_world_106.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"year % 4 == 0 조건에 따라 분기합니다: 결과가 No이면 윤년이 아닙니다로 이동하고, 결과가 YES이면 year % 100 == 0으로 이동합니다.year % 100 == 0 조건에 따라 분기합니다: 결과가 No이면 윤년 입니다로 이동하고, 결과가 YES이면 윤년이 아닙니다로 이동합니다.year % 400 == 0 조건에 따라 분기합니다: 결과가 YES이면 윤년 입니다로 이동하고, 결과가 No이면 윤년이 아닙니다로 이동합니다.\"}}"}
{"file_name": "kor_real_world_107.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"시작은 N과 연결됩니다.N은 N=0으로 연결됩니다.N=0은 N=N+1과 연결됩니다.N=N+1은 N으로 연결되어 N을 출력합니다.N은 N<100을 판별하여 결과에 따라 분기합니다: 결과가 Y이면 N=N+1로 이동하고, 결과가 N이면 끝로 이동합니다.\"}}"}
{"file_name": "eng_flowchart_8233.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Online shopping involves adding items to a cart. Once the items are added, the user proceeds to the checkout. At the checkout, the user is presented with different payment modes to choose from. If the user chooses to pay by credit card, they are directed to enter their card details. If the payment is successful, the order is placed, and if it fails, the user is prompted to retry the payment. Alternatively, if the user chooses to pay via PayPal, they are directed to login to their PayPal account. If the login is successful, the order is placed, and if it fails, the user is prompted to retry the login. On the other hand, if the user selects cash on delivery as the payment mode, they are directed to confirm the order. If the confirmation is successful, the order is placed. However, if it fails, the user is prompted to choose a new payment mode. In the case where the user chooses to choose a new payment mode, they are directed back to the payment mode selection screen to choose again.\"}}"}
{"file_name": "eng_c4_10.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"The System Context diagram for the Internet Banking System shows that there are several components involved. There are five customers of the bank, namely Banking Customer A, Banking Customer B, Banking Customer C, Banking Customer D, and Banking Customer E. These customers have personal bank accounts.The main system is the Internet Banking System, which allows customers to view information about their bank accounts and make payments. There is also a Mobile Banking App that allows customers to access their bank accounts and perform transactions from their mobile devices. Additionally, there is an ATM Banking System that allows customers to withdraw cash, deposit money, and check their account balance.The Internet Banking System depends on several other systems. The Mainframe Banking System stores all of the core banking information about customers, accounts, transactions, etc. The Customer Relationship Management System stores customer information, interactions, and preferences. The Payment Gateway System handles payments and transactions between the bank and external merchants.Within the BankBoundary, there are three other systems: Banking System A, Banking System B, and Banking System K. These systems also have personal bank accounts.There are also other components in the system. The E-mail system is the internal Microsoft Exchange e-mail system. The Banking System D Database is another system of the bank with personal bank accounts.There is a BankBoundary3, which includes three system queues: Banking System F Queue, Banking System G Queue, and Banking System X Queue. These queues are also systems of the bank with personal bank accounts.The relationships between the components are as follows: - All customers use the Internet Banking System.- The Internet Banking System uses the Mainframe Banking System, the Customer Relationship Management System, the Payment Gateway System, the Mobile Banking App, and the ATM Banking System.- The Mobile Banking App depends on the Internet Banking System.- The ATM Banking System depends on the Internet Banking System.- The Internet Banking System sends e-mails through the E-mail system.- The E-mail system sends e-mails to Banking Customer A.\"}}"}
{"file_name": "kor_flowchart_6910.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"성탄절에서 돈을 받으면 쇼핑을 하러 간다. 쇼핑을 하러 가서 생각해보고, 일을 할지, 이를 할지, 삼을 할지, 사를 할지 결정한다. 일을 한다면 노트북을 산다. 이를 한다면 아이폰을 산다. 삼을 한다면 자동차를 산다. 사를 한다면 가방을 산다. 가방을 산 다음에는 파티용품을 산다. 가방을 산 다음에는 여행가방을 산다. 가방을 산 다음에는 스포츠가방을 산다. 자동차를 산 다음에는 주유를 한다. 자동차를 산 다음에는 세차를 한다.\"}}"}
{"file_name": "kor_graphlr_226.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"생일에는 선물을 받고 쇼핑을 가기로 했다. 생각해보니 노트북, 아이폰, 그리고 자동차 중에 하나를 골라야 했다. 또한 가족을 만나기로도 했고, 선물을 구매하기로도 했다. 선물로는 장난감, 의류, 그리고 전자제품 중에 골라야 했다. 쇼핑 후에는 저녁식사를 하기로 했는데, 집에서 먹을지 레스토랑에서 먹을지 고민 중이다. 마지막으로 영화를 보기로 했는데, 영화관에서 볼지 집에서 볼지 고민 중이다.\"}}"}
{"file_name": "eng_seq_diagram_1873.jpg", "ground_truth": "{\"gt_parse\": {\"c2t\": \"Alice asks John how he is doing. John replies that he is doing pretty good. Then, John asks Bob how he is feeling, and Bob responds that he is feeling fantastic. Throughout the day, John completes his pending work and stays focused.\"}}"}
